<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Firefox Beta</string>
    <key>Identifier</key>
    <string>com.github.bretterteig.download.firefoxbeta</string>
    <key>Input</key>
    <dict>
        <key>Language</key>
        <string>en-US</string>
        <key>NAME</key>
        <string>FirefoxBeta</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://download.mozilla.org/?product=firefox-beta-latest-ssl&amp;os=osx&amp;lang=%Language%</string>
                <key>filename</key>
                <string>FirefoxBeta.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>