<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of PlantronicsHub and imports into a munki_repo.</string>
    <key>Identifier</key>
    <string>com.github.bretterteig.munki.PlantronicsHub</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_CATEGORY</key>
        <string>Drivers</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>NAME</key>
        <string>PlantronicsHub</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.mikestechshop.pkg.PlantronicsHubDesktop</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                    <key>catalogs</key>
                    <array>
                        <string>testing</string>
                    </array>
                    <key>category</key>
                    <string>%MUNKI_CATEGORY%</string>
                    <key>description</key>
                    <string>Plantronics Hub for Mac, part of the Plantronics software portfolio, is a client application that allows users to control the settings on their Plantronics audio device. Users can customize their ringtone and ring location, configure presence updates, and more. The software enhances the user experience by providing valuable information about the state of their Plantronics audio device, such as mute and battery status, easily visible at the bottom of the desktop.</string>
                    <key>developer</key>
                    <string>Plantronics Inc</string>
                    <key>display_name</key>
                    <string>Plantronics Hub</string>
                    <key>minimum_os_version</key>
                    <string>10.13.0</string>
                    <key>name</key>
                    <string>%NAME%</string>
                    <key>unattended_install</key>
                    <true/>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
